brew "mbedtls"
brew "nlohmann-json"
brew "cmake"
brew "ccache"
brew "freetype2"
brew "libmagic"
brew "pkg-config"
brew "curl"
brew "gcc@12"
brew "llvm"
brew "glfw"
brew "ninja"
brew "libarchive"
brew "zlib"
brew "xz"
brew "bzip2"
brew "zstd"