brew "mbedtls@3"
brew "nlohmann-json"
brew "cmake"
brew "ccache"
brew "freetype2"
brew "libmagic"
brew "pkg-config"
brew "curl"
brew "llvm@20"
brew "glfw"
brew "ninja"
brew "zlib"
brew "xz"
brew "bzip2"
brew "zstd"
brew "libssh2"
brew "md4c"